Revit 2027 API
BuiltInFailures.DecalFailures Class
 Failures about Decal.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DecalFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DecalFailures
Public NotInheritable Class DecalFailures
public ref class DecalFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DecalFailures = class end
The BuiltInFailures.DecalFailures type exposes the following members.
Properties
Name | Description
CannotPaste |  Can't place Decal at new position.
LongerThanPossible |  Decal element is longer than the circumference of the surface.
OutsideHost |  Decal does not lie on host.
Top
See Also
Reference
Autodesk.Revit.DB Namespace